<template>
  <div class="blog-box">
    <div class="blog-item" v-for="(item,index) in blogList">
      <h3>{{item.title}}</h3>
      <p>{{item.summary}}...</p>
      <hr>
    </div>
    <div class="get-new-list"></div>
  </div>
</template>

<script>
  export default {
    name: 'listPage',
    data() {
      return {
        blogList: [
          {
            title: '标题1',
            summary: '摘要摘要摘要摘要摘要摘要摘要摘要摘要摘要摘要摘要摘要摘要摘要摘要' +
            '摘要摘要摘要摘要摘要摘要摘要摘要摘要摘要摘要摘要摘要摘要摘要摘要摘要摘要摘要摘要摘要摘要摘要摘要摘要摘' +
            '要摘要摘要摘要摘要摘要摘要摘要摘要摘要摘要摘要摘要摘要摘要摘要摘要摘要摘要摘要摘要摘要摘要摘要摘要'
          },
          {
            title: '标题2',
            summary: '摘要1摘要1摘要1摘要1摘要1摘要1摘要1摘要1摘要1摘要1摘要1摘要1摘要1摘要1摘要1摘要1摘要1' +
            '摘要1摘要1摘要1摘要1摘要1摘要1摘要1摘要1摘要1摘要1摘要1摘要1摘要1摘要1摘要1摘要1摘要1摘要1摘要1摘要'
          },
          {
            title: '标题3',
            summary: '摘要摘要摘要摘要摘要摘要摘要摘要摘要摘要摘要摘要摘要摘要摘要摘要' +
            '摘要摘要摘要摘要摘要摘要摘要摘要摘要摘要摘要摘要摘要摘要摘要摘要摘要摘要摘要摘要摘要摘要摘要摘要摘要摘' +
            '要摘要摘要摘要摘要摘要摘要摘要摘要摘要摘要摘要摘要摘要摘要摘要摘要摘要摘要摘要摘要摘要摘要摘要摘要'
          },
          {
            title: '标题4',
            summary: '摘要1摘要1摘要1摘要1摘要1摘要1摘要1摘要1摘要1摘要1摘要1摘要1摘要1摘要1摘要1摘要1摘要1' +
            '摘要1摘要1摘要1摘要1摘要1摘要1摘要1摘要1摘要1摘要1摘要1摘要1摘要1摘要1摘要1摘要1摘要1摘要1摘要1摘要'
          },
          {
            title: '标题5',
            summary: '摘要摘要摘要摘要摘要摘要摘要摘要摘要摘要摘要摘要摘要摘要摘要摘要' +
            '摘要摘要摘要摘要摘要摘要摘要摘要摘要摘要摘要摘要摘要摘要摘要摘要摘要摘要摘要摘要摘要摘要摘要摘要摘要摘' +
            '要摘要摘要摘要摘要摘要摘要摘要摘要摘要摘要摘要摘要摘要摘要摘要摘要摘要摘要摘要摘要摘要摘要摘要摘要'
          },
          {
            title: '标题6',
            summary: '摘要1摘要1摘要1摘要1摘要1摘要1摘要1摘要1摘要1摘要1摘要1摘要1摘要1摘要1摘要1摘要1摘要1' +
            '摘要1摘要1摘要1摘要1摘要1摘要1摘要1摘要1摘要1摘要1摘要1摘要1摘要1摘要1摘要1摘要1摘要1摘要1摘要1摘要'
          },
          {
            title: '标题7',
            summary: '摘要摘要摘要摘要摘要摘要摘要摘要摘要摘要摘要摘要摘要摘要摘要摘要' +
            '摘要摘要摘要摘要摘要摘要摘要摘要摘要摘要摘要摘要摘要摘要摘要摘要摘要摘要摘要摘要摘要摘要摘要摘要摘要摘' +
            '要摘要摘要摘要摘要摘要摘要摘要摘要摘要摘要摘要摘要摘要摘要摘要摘要摘要摘要摘要摘要摘要摘要摘要摘要'
          },
          {
            title: '标题8',
            summary: '摘要1摘要1摘要1摘要1摘要1摘要1摘要1摘要1摘要1摘要1摘要1摘要1摘要1摘要1摘要1摘要1摘要1' +
            '摘要1摘要1摘要1摘要1摘要1摘要1摘要1摘要1摘要1摘要1摘要1摘要1摘要1摘要1摘要1摘要1摘要1摘要1摘要1摘要'
          },
          {
            title: '标题9',
            summary: '摘要摘要摘要摘要摘要摘要摘要摘要摘要摘要摘要摘要摘要摘要摘要摘要' +
            '摘要摘要摘要摘要摘要摘要摘要摘要摘要摘要摘要摘要摘要摘要摘要摘要摘要摘要摘要摘要摘要摘要摘要摘要摘要摘' +
            '要摘要摘要摘要摘要摘要摘要摘要摘要摘要摘要摘要摘要摘要摘要摘要摘要摘要摘要摘要摘要摘要摘要摘要摘要'
          },
          {
            title: '标题10',
            summary: '摘要1摘要1摘要1摘要1摘要1摘要1摘要1摘要1摘要1摘要1摘要1摘要1摘要1摘要1摘要1摘要1摘要1' +
            '摘要1摘要1摘要1摘要1摘要1摘要1摘要1摘要1摘要1摘要1摘要1摘要1摘要1摘要1摘要1摘要1摘要1摘要1摘要1摘要'
          },
        ]
      }
    },
    methods: {
      // 懒加载列表
    },
    mounted: function () {

    }
  }
</script>

<style scoped lang="less">
  .blog-box {
    width: 1000px;
    margin: auto;
  }

  .blog-item {
    > h3 {
      color: #333;
      margin: 40px 0 20px 0;
    }
    > p {
      color: #999;
      margin: 20px 0 40px 0;
      font-size: 13px;
      line-height: 24px;
    }
    > hr {
      border: 0.5px solid #c1c1c1;
    }
  }

  .get-new-list {
    height: 150px;
  }
</style>
